app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])
    @article.update(post_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-06-11 18:04:33.217862"], ["id", 1]]